Autodesk.Revit.DB.Structure.Rebar.IsRebarFreeFromWithAllBarsInSamePlane(Autodesk.Revit.DB.Plane)
Returns true if the rebar is free form and all bars are in the same plane.
plane:
if this return true, this is the plane that contains all bars. Otherwise it will be initialozed to XoY plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.GetKnownTotalNumberOfBars
For formula without variation = total number of bars
For formula with variation = number of bars for non-variable members.
If the formula has only one variable member, the number of bars will be 2.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.GetPickFromBarIndex(System.Int32)
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SplitRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ISet{System.Int32},System.Boolean,System.Boolean)
Splits a rebar into multiple sets at specified bar indices.
Given split indices (e.g., {ii, jj}) in barIndices, the function creates three rebar sets: from 0 to ii, ii+1 to jj, and jj+1 to NumberOfBarPositions - 1.
Edge Case: A split at index 0 creates a first set with one bar; a split at the last index does nothing, as no bars follow.
If a split is made at an index where the bar is not included, the split will still occur, and the unincluded bar will remain unchanged in the new set created after the split.
This method applies to a Shape Driven Rebar whose definition is RebarShapeDefinitionBySegments, for 3D Path Free Form Rebar and for Morphed Free Form Rebar.
For Morphed Free Form Rebar that targets Spiral or Lapped Circle shapes, split cannot be made.
document:
The document.
rebarToSplit:
The rebar that will be split
barIndices:
The array storing the indices of the initial bars from the rebar where the splits will occur.
constrainSplitSets:
If this is true, Rebar Plane of the split set with index ii in the output array will be constrained to Out of Plane of the set split set with index ii-1 in the output array (or Rebar Plane if the layout is Single). If it is false, it will be no constraint between the resulted sets.
This parameter has no effect for 3D Path free form rebars.
splitAllSetsInSpliceChain:
If this is true, all sets in the splice chain will be split and the splice relationships will be maintained. If it is false, only the selected set will be split and no splice relationship will be preserved.
This parameter has no effect for 3D Path free form rebars.
Returns:
Returns the ids of the rebars that are considerred to be split.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Free Form Rebars other than 3D Path or Morphed, rebar sets with only one bar included or rebars that are part of a group can't be split.
Morphed Free Form Rebars that targets Spiral or Lapped Circle shapes can't be split.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
One or more bar indices are invalid. All indices must be within the range of [0, NumberOfBarPositions - 2].
For 3D Path Free Form Rebar, the indices must not be consecutive and each new set created by the split must intersect at least one path edge.
For Morphed Free Form Rebar, the indices must not be consecutive.
Since:
2026.3

Autodesk.Revit.DB.Structure.Rebar.IsCustomSpacingWithPredefinedNumberOfBars
Checks if the layout is defined as a Custom Spacing Layout with a predefined number of bars.
Custom Spacing layout will have a predefined number of bars if the formula is fixed (not variable and without percentage members).
Returns:
Returns true, if the Layout is Custom Spacing and it has a predefined number of bars(the formula is fixed).
It will return false if the layout is other than Custom Spacing or if the formula is variable or has percentage members.
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.GetSpacingsBetweenBars
Gets the spacings between all bars in set that have CustomSpacing layout. It will consider that there are no moved or removed bars from the set.
Returns:
Returns the spacings between all bars in set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Rebar should have CustomSpacing layout.
-or-
The Free Form Rebar doesn't have set a distribution path.
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.ComputeSpacingsBetweenBars(Autodesk.Revit.DB.Document,System.String,System.Double)
Computes the spacings between all bars as we would have a set with CustomSpacing layout, the customSpacingFormula and its length being distributionLength.
document:
A document.
customSpacingFormula:
The formula to be used to compute spacings.
distributionLength:
The length along which the bars will be distributed.
This length will be used only if the formula contains "?" or percentages.
Returns:
Returns the spacings between all bars in set.
If the bars doesn't fit in the input distributionLength, the returned array will be empty.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified formula is not valid (doesn't have a valid syntax).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distributionLength must be positive.
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.IsValidCustomSpacingFormula(Autodesk.Revit.DB.Document,System.String)
Checks if the specified formula is valid (has a valid syntax).
document:
A document.
formula:
The formula to check.
Returns:
Returns true if the specified formula is valid (has a valid syntax), false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.GetLayoutFormula(System.Boolean)
Gets the formula that is used to compute the spacings between bars.
formatFormula:
If it's false the returned string will contain values that are not rounded and they are in internal Revit units (decimal feet), otherwise it will be formatted according to project units.
Returns:
Returns the formula that is used to compute the spacings between bars.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Rebar should have CustomSpacing layout.
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.SetLayoutFormula(System.String)
Sets the specified formula for custom spacing.
customSpacingFormula:
The formula that will be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified formula is not valid (doesn't have a valid syntax).
-or-
The formula determines an array length of the Rebar set that is not between (0, 10000] feet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Rebar should have CustomSpacing layout.
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.ResetMovedBarTransform(System.Int32)
Reset the transformation representing the movement of the bar relative to its default position along the distribution path.
The moved bar transform will be set to Identity.
barPositionIndex:
The bar index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barPositionIndex should be included.
Since:
2022

Autodesk.Revit.DB.Structure.Rebar.GetMovedBarTransform(System.Int32)
Returns a transform representing the movement of the bar relative to its default position along the distribution path.
barPositionIndex:
The bar index.
Returns:
The transform representing the movement of the bar relative to its default position along the distribution path.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barPositionIndex should be included.
Since:
2022

Autodesk.Revit.DB.Structure.Rebar.MoveBarInSet(System.Int32,Autodesk.Revit.DB.Transform)
This method applies the transformation matrix to the rebar bar at the desired position in the rebar set.
If the bar was already moved, the method will concatenate the transformation matrix with the existing movement.
barPositionIndex:
The bar index of the rebar to apply the transformation.
moveTransform:
The transformation matrix to apply to the specified rebar bar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barPositionIndex should be included.
-or-
moveTransform is not conformal.
Since:
2022

Autodesk.Revit.DB.Structure.Rebar.GetOverridableCrankParameters
Gets the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters.
Returns:
Returns the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.IsCrankLengthOverrideEnabled
Returns true if the ability to override crank lengths is enabled for this rebar instance, false otherwise.
Returns:
Returns true if the ability to override crank lengths is enabled for this rebar instance, false otherwise.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.EnableCrankLengthOverride(System.Boolean)
Enables or disables the ability to override crank lengths for this rebar instance.
enable:
True to enable, False to disable.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.SetTerminationRotationAngle(System.Int32,System.Double)
Sets the termination's (e.g hook, crank) out of plane rotation angle at the specified end.
end:
0 for the start, 1 for the end.
rotationAngle:
The termination's (e.g hook, crank) out of plane rotation angle at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for rotationAngle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.GetTerminationRotationAngle(System.Int32)
Gets the termination's (e.g hook, crank) out of plane rotation angle at the specified end.
end:
0 for the start, 1 for the end.
Returns:
Returns the termination's (e.g hook, crank) out of plane rotation angle at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.SetTerminationOrientation(System.Int32,Autodesk.Revit.DB.Structure.RebarTerminationOrientation)
Sets the orientation of the termination's (e.g. hook, crank) plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
end:
0 for the start termination, 1 for the end termination.
terminationOrientation:
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.GetTerminationOrientation(System.Int32)
Gets the orientation of the termination's (e.g. hook, crank) plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
end:
0 for the start termination, 1 for the end termination.
Returns:
Returns the orientation of the termination's (e.g. hook, crank) plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
Value = Right: The termination is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.HookAngleMatchesRebarShapeDefinition(System.Int32,Autodesk.Revit.DB.ElementId)
Checks that the hook angle of the specified RebarHookType matches the hook angle used in the Rebar's RebarShape at the specified end of the bar.
Remarks:
Also checks that the specified id is a valid RebarHookType.
If RebarShapeDefinesHooks property of ReinforcementSettings is false (European shapes), every valid hook angle matches RebarShape definition.
If RebarShapeDefinesHooks property of ReinforcementSettings is true (non-European shapes), hook angle matches RebarShape definition if it is null or equal RebarShape default hook angle.
end:
0 for the start hook, 1 for the end hook.
proposedHookId:
The Id of the RebarHookType
Returns:
Returns true if the hook angle of the RebarHookType matches the angle used in the RebarShape at the specified end of the bar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2014

Autodesk.Revit.DB.Structure.Rebar.AreBarIndicesValidForSplit(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ISet{System.Int32})
Verifies that all bar indices in the input set are within the valid range of [0, NumberOfBarPositions - 2].
For a 3D Path or Morphed Free Form Rebar, single layout Rebar sets cannot result from a split, so the bar indices in the input set must not be consecutive.
For a 3D Path Free Form Rebar, this also validates that each new set created by the split will have at least one bar plane intersecting a path edge.
document:
The document.
elementIdToCheck:
The elementId to check.
barIndices:
The set of bar indices to validate.
Returns:
Returns true if the validation is successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Free Form Rebars other than 3D Path or Morphed, rebar sets with only one bar included or rebars that are part of a group can't be split.
Morphed Free Form Rebars that targets Spiral or Lapped Circle shapes can't be split.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.CanElementBeSplit(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if the element is a rebar that can be split.
Remarks:
Free Form Rebars other than 3D Path or Morphed, rebar sets with only one bar included or rebars that are part of a group can't be split.
Morphed Free Form Rebars that targets Spiral or Lapped Circle shapes can't be split.
document:
The document
elementIdToCheck:
The elementId that need to be checked
Returns:
Returns true if the element is a Rebar that can be split, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.ContainsValidArcRadiiForStyleAndBarType(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType)
Checks that all arcs in the chain of curves have radii that are not less than minimum bend radius for bar type and style
curves:
An array of curves intended to define the shape of the rebar curves.
Bends, hooks and cranks should not be included in the array of curves.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
Returns:
Returns true if all arc bend radii are not less than minimum bend radius for bar type and style
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetCrankLengthOverride(System.Int32,System.Double)
Sets the crank length at the indicated bar end as an override value.
end:
The bar end.
crankLength:
The crank length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
-or-
The ability to override crank lengths is not enabled for this rebar instance. Use enableCrankLengthOverride(true) to enable it.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.GetCrankLength(System.Int32)
Gets the crank length at the indicated bar end.
If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
end:
The bar end.
Returns:
Returns the crank length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.SetCrankAngledLengthOverride(System.Int32,System.Double)
Sets the crank angled length at the indicated bar end as an override value.
Remarks:
When the crank angled length is set, the crank ratio is keeping the same value. The offset length and straight length are adjusted.
end:
The bar end.
crankAngledLength:
The crank angled length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
-or-
The ability to override crank lengths is not enabled for this rebar instance. Use enableCrankLengthOverride(true) to enable it.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.GetCrankAngledLength(System.Int32)
Gets the crank angled length at the indicated bar end.
If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
end:
The bar end.
Returns:
Returns the crank angled length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.SetCrankStraightLengthOverride(System.Int32,System.Double)
Sets the crank straight length at the indicated bar end as an override value.
Remarks:
When the crank straight length is set, the crank ratio is keeping the same value. The offset length and angled length are adjusted.
end:
The bar end.
crankStraightLength:
The crank straigth length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
-or-
The ability to override crank lengths is not enabled for this rebar instance. Use enableCrankLengthOverride(true) to enable it.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.GetCrankStraightLength(System.Int32)
Gets the crank straight length at the indicated bar end.
If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
end:
The bar end.
Returns:
Returns the crank straigth length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.SetCrankOffsetLengthOverride(System.Int32,System.Double)
Sets the crank offset length at the indicated bar end as an override value.
Remarks:
When the crank offset length is set, the crank ratio is keeping the same value. The angled length and straight length are adjusted.
end:
The bar end.
crankOffsetLength:
The crank offset length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
-or-
The ability to override crank lengths is not enabled for this rebar instance. Use enableCrankLengthOverride(true) to enable it.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.GetCrankOffsetLength(System.Int32)
Gets the crank offset length at the indicated bar end.
If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
end:
The bar end.
Returns:
Returns the crank offset length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.SetCrankRatioOverride(System.Int32,System.Double)
Sets the crank ratio at the indicated bar end as an override value.
Remarks:
The crank slope is 1/crankRatio.
When the crank ratio is set, the crank offset length is keeping the same value. The angled length and straight length are adjusted.
end:
The bar end.
crankRatio:
The crank ratio.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
-or-
The ability to override crank lengths is not enabled for this rebar instance. Use enableCrankLengthOverride(true) to enable it.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.GetCrankRatio(System.Int32)
Gets the crank ratio at the indicated bar end.
Remarks:
The crank slope is 1/crankRatio.
If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
end:
The bar end.
Returns:
Returns the crank ratio.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bar does not have a valid Rebar Crank Type at the end.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.SetCrankTypeId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets the id of the Crank Type to be applied to the rebar.
end:
0 for the start Crank, 1 for the end Crank.
crankTypeId:
The id of a Crank Type element, or invalidElementId if the rebar should have no crank at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the parameter crankTypeId is not a Rebar Crank Type.  It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.GetCrankTypeId(System.Int32)
Gets the id of the Crank Type id that is applied to the rebar.
Remarks:
Interactions with Rebar Crank Types can be done with the functions in Autodesk::Revit::DB::Structure::RebarCrankTypeUtils.
end:
0 for the start Crank, 1 for the end Crank.
Returns:
Returns the id of a Crank Type, or invalidElementId if the rebar has no crank at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.GetParameterValueAtIndex(Autodesk.Revit.DB.ElementId,System.Int32)
Get the parameter value for a bar at the specified index.
Remarks:
For rebar sets which don't have varying length bars the returned ParameterValue is the same no matter the index.
For rebar sets which have varying length bars the returned ParameterValue is evaluated at the given index.
paramId:
The parameter Id.
barPositionIndex:
The bar index in the rebar distribution. Accepts only values between 0 and NumberOfBarPositions-1.
Returns:
The ParameterValue for given parameterId and barPositionIndex.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barPositionIndex should be included.
Since:
2017

Autodesk.Revit.DB.Structure.Rebar.SetBarIncluded(System.Boolean,System.Int32)
Sets if the bar at the desired index is included or not.
include:
True to include the bar, false to exclude the bar.
barPositionIndex:
The bar index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barPositionIndex should be included.
Since:
2022

Autodesk.Revit.DB.Structure.Rebar.DoesBarExistAtPosition(System.Int32)
Checks whether a bar is included at the specified position.
barPosition:
A bar position index between 0 and NumberOfBarPositions-1.
Returns:
Returns true if the bar at the specified position is included, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPosition should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barPosition should be included.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.GetPresentationBarIndicesForSpliceChain(System.Int32,System.Boolean)
Given a bar index on this rebar, returns the corresponding bar index on each rebar in the splice chain.
Remarks:
Traverses the splice chain in both directions from this rebar. For each set,
selects the nearest bar beyond twice the bar diameter from the reference point.
The search direction alternates between sets: even-indexed sets search from first
bar toward last, odd-indexed sets search from last bar toward first.
If stagger is present, only bars with the same even/odd parity as the input bar are considered.
When bNoShift is true, distance and direction filters are skipped.
barIndex:
The starting bar index on this rebar.
bNoShift:
If true, the distance filter and direction logic are skipped.
Returns:
A map from each rebar element id in the chain to its corresponding bar index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barIndex should be included.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2027.2

Autodesk.Revit.DB.Structure.Rebar.IsBarHidden(Autodesk.Revit.DB.View,System.Int32)
Identifies if a given bar in this rebar set is hidden in this view.
view:
The view.
barIndex:
The index of the bar from this rebar set.
Returns:
True if the bar is hidden in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barIndex should be included.
Since:
2015

Autodesk.Revit.DB.Structure.Rebar.SetBarHiddenStatus(Autodesk.Revit.DB.View,System.Int32,System.Boolean)
Sets the bar in this rebar set to be hidden or unhidden in the given view.
Remarks:
Individual bars of a rebar set can be hidden in a view only
if the presentation mode is RebarPresentationMode.Select.
If that is not the presentation mode assigned for this set in the view,
this method will also change it.
view:
The view.
barIndex:
The index of the bar from this set.
hide:
True to hide this bar in the view, false to unhide the bar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This rebar cannot have a presentation mode applied for view, as the view is not valid for rebar presentation,
or the orientation of the view matches the normal direction of the rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barIndex should be included.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2015

Autodesk.Revit.DB.Structure.Rebar.SetEndTreatmentTypeId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets the id of the EndTreatmentType to be applied to the rebar.
This can be done if and only if the end of the bar on which the end treatment is applied has no RebarCoupler on it, otherwise will throw an exception.
end:
0 for the start end treatment, 1 for the end end treatment.
endTreatmentTypeId:
The id of a EndTreatmentType element, or invalidElementId if
the rebar should have no end treatment at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the parameter endTreatmentTypeId is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the Rebar end end has a RebarCoupler on it.
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.GetEndTreatmentTypeId(System.Int32)
Get the id of the EndTreatmentType that is applied to the rebar.
end:
0 for the start end treatment, 1 for the end end treatment.
Returns:
The id of a EndTreatmentType, or invalidElementId if the rebar has
no end treatment at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetHookTypeId(System.Int32,Autodesk.Revit.DB.ElementId)
Set the id of the RebarHookType to be applied to the rebar.
end:
0 for the start hook, 1 for the end hook.
hookTypeId:
The id of a RebarHookType element, or invalidElementId if
the rebar should have no hook at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookTypeId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.GetHookTypeId(System.Int32)
Get the id of the RebarHookType that is applied to the rebar.
end:
0 for the start hook, 1 for the end hook.
Returns:
The id of a RebarHookType, or invalidElementId if the rebar has
no hook at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.GetTransformedCenterlineCurves(System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.MultiplanarOption,System.Int32)
A chain of curves representing the centerline of the rebar.
Remarks:
This method will return the centerline curves for bar at barPositionIndex even if this bar isn't included.
The curves are in the final position. The BarPositionTransform (representing the relative position of any individual bar in the set - a translation along the distribution path)
and MovedBarTransform (representing the movement of the bar relative to its default position along the distribution path) will be applied to the returned curves.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooksAndCranks:
Identifies if the chain will include hooks and the crank curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
multiplanarOption:
If the Rebar is a multi-planar shape, this parameter controls whether to generate only
the curves in the primary plane (IncludeOnlyPlanarCurves), or to generate all curves,
(IncludeAllMultiplanarCurves) including the out-of-plane connector segments as well as
multi-planar copies of the primary plane curves.
This argument is ignored for planar shapes.
barPositionIndex:
The bar index.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barPositionIndex should be included.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.Structure.Rebar.GetCenterlineCurves(System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.MultiplanarOption,System.Int32)
A chain of curves representing the centerline of the rebar.
Remarks:
This method will return the centerline curves for bar at barPositionIndex even if this bar isn't included.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooksAndCranks:
Identifies if the chain will include hooks and the crank curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
multiplanarOption:
If the Rebar is a multi-planar shape, this parameter controls whether to generate only
the curves in the primary plane (IncludeOnlyPlanarCurves), or to generate all curves,
(IncludeAllMultiplanarCurves) including the out-of-plane connector segments as well as
multi-planar copies of the primary plane curves.
This argument is ignored for planar shapes.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Use the barPositionIndex to obtain all the curves at a specific index in the distribution.
You can use GetNumberOfBarPositions() to verify if a specific rebar has more than one bar positions.
This is useful for rebar sets that have varying length bars. In this case you can retrieve the
centerline curve geometry of that particular bar, by passing the appropriate index
If the rebar set don't have varying bars, the form of the bars does not vary from one index to another.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barPositionIndex should be included.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurvesAndShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.BarTerminationsData)
Creates a new instance of a shape driven Rebar element within the project.
The instance will have the default shape parameters from the RebarShape.
The curves and terminations data should match the rebar shape definition.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false,
the hooks and their rotation angles can be different than the defaults specified in the RebarShape.
If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to false,
the end treatments can be different than the defaults specified in the RebarShape.
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element that matches curves, and terminations data.
A RebarShape element that provides the RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
See # Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends, hooks and cranks should not be included in the array of curves.
barTerminationsData:
Data about the Rebar's terminations.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
The barTerminationsData was not created using the input document.
-or-
The barTerminationsData was not created using the rebarShape's document.
-or-
The barTerminationsData was not created using the barType's document.
-or-
The input curves are too small to apply crank on them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.CreateFromRebarShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new shape driven Rebar, as an instance of a RebarShape.
The instance will have the default shape parameters from the RebarShape,
and its location is based on the bounding box of the shape in the shape definition.
Hooks and cranks are removed from the shape before computing its bounding box.
If appropriate hooks and cranks can be found in the document, they will be assigned arbitrarily.
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
origin:
The lower-left corner of the shape's bounding box will be placed at this point in the project.
xVec:
The x-axis in the shape definition will be mapped to this direction in the project.
yVec:
The y-axis in the shape definition will be mapped to this direction in the project.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurves(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.BarTerminationsData,System.Boolean,System.Boolean)
Creates a new instance of a shape driven Rebar element within the project.
doc:
A document.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends, hooks and cranks should not be included in the array of curves.
barTerminationsData:
Data about the Rebar's terminations.
useExistingShapeIfPossible:
Attempts to assign a RebarShape from those existing in the document. If no shape matches, this function returns null if createNewShape is false or it will create a new shape if createNewShape is true.
When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true".
createNewShape:
Creates a shape in the document to match the curves, terminations and specified style and assigns it to the new rebar instance.
Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes
have enough shape parameters to define a shape for these curves.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
The barTerminationsData was not created using the input document.
-or-
The input curves are too small to apply crank on them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Both useExistingShapeIfPossible and createNewShape are false.
-or-
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and bar style.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.CreateFreeForm(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.Structure.RebarStyle)
Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
Remarks:
The created rebar will have curves.Count bars. The layout will be Single if curves.Count is 1, otherwise will be Fixed Number and will not be changeable.
Setting a new list of curves will only change the number of bars in set.
This function can fail due to following reasons: The array of CurveLoops is empty.At least one CurveLoop is empty.At least one CurveLoop contains an unbounded curve.A rebar constructed from curves can't be bent according to the bending radius.
doc:
A document.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
curves:
Each curve loop represents a bar in the set.
style:
The usage of the bar, "standard" or "stirrup/tie".
Returns:
Returns a class that stores the newly created Free Form Rebar and the error code. If there is any error, the Rebar will be null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.CreateFreeForm(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.Curve}},Autodesk.Revit.DB.Structure.RebarStyle)
Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
Remarks:
The created rebar will have curves.Count bars. The layout will be Single if curves.Count is 1, otherwise will be Fixed Number and will not be changeable.
Setting a new list of curves will only change the number of bars in set.
This function can fail due to following reasons: One or more of the input curves was null.One or more of the input curves was unbounded.Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.A rebar constructed from curves can't be bent according to the bending radius.
doc:
A document.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
curves:
Each array of curves represent a bar in the set.
style:
The usage of the bar, "standard" or "stirrup/tie".
Returns:
Returns a class that stores the newly created Free Form Rebar and the error code. If there is any error, the Rebar will be null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.CreateFreeForm(Autodesk.Revit.DB.Document,System.Guid,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element)
Creates a free form rebar that can have constraints.
Remarks:
For this type of Free Form Rebar, the layout can be changed. The server identified by serverGUID will have the responsibility to create the curves for the specified layout.
It requires a server GUID which will have the responsibility to define bar handles(which will be constrained) and to do the calculation of the curves.
See Autodesk::Revit::DB::Structure::IRebarUpdateServer for more details.
doc:
A Document.
serverGUID:
The API server GUID.
Should be the same that the function GetServerId() from class derived from Autodesk::Revit::DB::Structure::IRebarUpdateServer returns.
This server has the responsibility to calculate the bars of Rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
Returns:
The newly created free form Rebar Instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
host is not a valid rebar host.
-or-
The server with serverGUID was not registered for RebarUpdateService.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.Rebar.NumberOfBarPositions
The number of potential bars in the set.
Remarks:
The number of positions is equal to the number of actual bars (the Quantity), plus the number of bars that are excluded.
The number of bar positions can be set for a rebar set with layout rule FixedNumber or NumberWithSpacing.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: This rebar element represents a single bar (the layout rule is Single).
-or-
When setting this property: The rebar set layout does not permit changing the number of bar positions.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.Mass
Identifies the mass of the rebar set. It is computed as the sum of the masses of all individual bars.
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.MaxSpacing
Identifies the maximum spacing between rebar in rebar set.
Remarks:
The maximum spacing can be set for rebar sets with layout rule MaximumSpacing, MinimumClearSpacing or NumberWithSpacing.
For a set with layout rule CustomSpacing the spacings can be set through the formula. Use Autodesk.Revit.DB.Structure.Rebar.GetSpacingsBetweenBars to get them.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The maxSpacing isn't bigger than 0.0.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
MaxSpacing can't be obtained for a set whose layout rule is Single or CustomSpacing.
-or-
When setting this property: This rebar element represents a single bar (the layout rule is Single).
-or-
When setting this property: The rebar set layout does not permit changing the maximum spacing.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.FreeFormMorphedServerGuid
Guid used for identifying the external IRebarUpdateServer for computing Morphed Free Form Rebar.
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.FreeForm3DPathServerGuid
Guid used for identifying the external IRebarUpdateServer for computing 3D Path Free Form Rebar.
Since:
2027

Autodesk.Revit.DB.Structure.Rebar.FreeFormSurfaceServerGuid
Guid used for identifying the external IRebarUpdateServer for computing Surface Free Form Rebar.
Since:
2026

Autodesk.Revit.DB.Structure.Rebar.FreeFormAlignedServerGuid
Guid used for identifying the external IRebarUpdateServer for computing Aligned Free Form Rebar.
Since:
2026